In [1]:
import pandas as pd

Load the JSON

In [2]:
df = pd.read_json("../ex03/auto.json")
df.set_index("CarNumber",inplace=True)

In [3]:
df

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
E432XX77RUS        1   6500.000000  Toyota    Camry
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[725 rows x 4 columns]

#2.1 Display the rows where the fines are greater than 2,100

In [4]:
df[df['Fines'] > 2100]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
E432XX77RUS        1   6500.000000      Toyota    Camry
92918M178RUS       1   5700.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
E40577152RUS       1   8594.586466        Ford    Focus
...              ...           ...         ...      ...
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
O22097197RUS       1  24300.000000        Ford    Focus
M0309X197RUS       1  22300.000000        Ford    Focus
H419XE197RUS       2   8594.586466      Toyota  Corolla

[455 rows x 4 columns]

#2.2 Display the rows where the fines are greater than 2,100 and the refund equals 2.

In [5]:
df[(df['Refund'] == 2) & (df['Fines'] > 2100) ]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
707987163RUS       2   2200.000000        Ford    Focus
K330T8197RUS       2   8200.000000       Skoda  Octavia
M592CH197RUS       2   8594.586466       Skoda  Octavia
...              ...           ...         ...      ...
O136HO197RUS       2   7800.000000      Toyota  Corolla
O68897197RUS       2  12300.000000        Ford    Focus
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
H419XE197RUS       2   8594.586466      Toyota  Corolla

[309 rows x 4 columns]

#2.3 Display the rows where the models are from the list: [’Focus’, ’Corolla’]

In [6]:
df[df['Model'].isin(['Focus','Corolla'])]

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
H234YH197RUS       2   6000.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[593 rows x 4 columns]

#2.4 Display the rows where the car number is from the list:

In [7]:
df_new = df.reset_index()
df_new[df_new['CarNumber'].isin(['Y7689C197RUS', '92928M178RUS', '7788KT197RUS', 'H115YO163RUS', 'X758HY197RUS'])]

        CarNumber  Refund          Fines  Make  Model
28   92928M178RUS       1    8594.586466  Ford  Focus
35   H115YO163RUS       1    2200.000000  Ford  Focus
71   7788KT197RUS       2   12000.000000  Ford  Focus
98   X758HY197RUS       2   24200.000000  Ford  Focus
158  X758HY197RUS       2   72600.000000  Ford  Focus
183  Y7689C197RUS       1   27000.000000  Ford  Focus
191  92928M178RUS       1     600.000000  Ford  Focus
215  H115YO163RUS       1    8594.586466  Ford  Focus
272  H115YO163RUS       2    1100.000000  Ford  Focus
283  7788KT197RUS       2    8594.586466  Ford  Focus
376  7788KT197RUS       1   20000.000000  Ford  Focus
401  X758HY197RUS       2  145200.000000  Ford  Focus
465  92928M178RUS       1    1200.000000  Ford  Focus
531  Y7689C197RUS       2    9000.000000  Ford  Focus
554  Y7689C197RUS       2   45000.000000  Ford  Focus
555  7788KT197RUS       2    4000.000000  Ford  Focus
665  Y7689C197RUS       1   36000.000000  Ford  Focus
674  92928M178RUS       2    3000.000000  Ford  Focus

#3 Make the aggregations with the make and model

In [8]:
grouped = df.groupby('Make')
grouped['Fines'].median()

Make
Audi          4200.0
BMW           6500.0
Ford          3500.0
Skoda         3250.0
Toyota        7700.0
Volkswagen    4300.0
Volvo         8500.0
Name: Fines, dtype: float64

In [9]:
grouped = df.groupby(by=['Make','Model'])
grouped['Fines'].median()

Make        Model
Audi                   4200.0
BMW                    6500.0
Ford        Focus      3500.0
            Mondeo     7650.0
Skoda       Octavia    3250.0
Toyota      Camry      7700.0
            Corolla    7700.0
Volkswagen             7400.0
            Golf       4800.0
            Jetta      2800.0
            Passat     3500.0
            Touareg    5800.0
Volvo                  8500.0
Name: Fines, dtype: float64

In [10]:
grouped = df.groupby(by=['Make','Model'])
grouped['Fines'].count()

Make        Model
Audi                     1
BMW                      3
Ford        Focus      575
            Mondeo       6
Skoda       Octavia     48
Toyota      Camry       16
            Corolla     18
Volkswagen               3
            Golf        20
            Jetta        6
            Passat      22
            Touareg      5
Volvo                    2
Name: Fines, dtype: int64

In [11]:
grouped = df.groupby(by=['Make','Model'])
grouped['Fines'].std()

Make        Model
Audi                            NaN
BMW                     2826.561226
Ford        Focus      15041.269437
            Mondeo     18987.329108
Skoda       Octavia    24339.742174
Toyota      Camry       6410.250654
            Corolla     9629.325617
Volkswagen              3674.688195
            Golf       36950.839950
            Jetta      17743.026799
            Passat      6969.739135
            Touareg     3461.778173
Volvo                   2404.163056
Name: Fines, dtype: float64

#4.1 Display the car numbers, grouped by the number of fines in descending order.

In [12]:
df.reset_index()
grouped = df.groupby(by='CarNumber')
grouped['Fines'].count().sort_values(ascending=False)

CarNumber
Y7689C197RUS    4
92928M178RUS    4
7788KT197RUS    4
H115YO163RUS    3
X758HY197RUS    3
               ..
E42577152RUS    1
E42377152RUS    1
E41977152RUS    1
E41577152RUS    1
H917TC36RUS     1
Name: Fines, Length: 531, dtype: int64

#4.2 Select from the initial dataframe all the rows corresponding to the top-1 car number

In [13]:
df[df.index == 'Y7689C197RUS']

              Refund    Fines  Make  Model
CarNumber
Y7689C197RUS       1  27000.0  Ford  Focus
Y7689C197RUS       2   9000.0  Ford  Focus
Y7689C197RUS       2  45000.0  Ford  Focus
Y7689C197RUS       1  36000.0  Ford  Focus

#4.3 Display the car numbers grouped by sum of fines in descending order.

In [14]:
df.reset_index()
grouped = df.groupby(by='CarNumber')
grouped['Fines'].sum().sort_values(ascending=False)

CarNumber
X758HY197RUS    242000.0
9020YC197RUS    217500.0
M0279X197RUS    216000.0
Y352O8197RUS    207200.0
Y778EE197RUS    192000.0
                  ...
83218C154RUS       100.0
Y195O8161RUS       100.0
K376HE161RUS       100.0
705787163RUS       100.0
K326T8197RUS       100.0
Name: Fines, Length: 531, dtype: float64

#4.4 Select all the rows corresponding to the top-1 car number from the initial dataframe

In [15]:
df[df.index == 'X758HY197RUS']

              Refund     Fines  Make  Model
CarNumber
X758HY197RUS       2   24200.0  Ford  Focus
X758HY197RUS       2   72600.0  Ford  Focus
X758HY197RUS       2  145200.0  Ford  Focus

#4.5 Display a table that answers the question, "Are there any car numbers connected to different models?"

In [16]:
car_numbers = df.groupby('CarNumber')['Model'].nunique()
car_multiple = car_numbers[car_numbers > 1]

df[df.index.isin(car_multiple.index)]

              Refund   Fines        Make    Model
CarNumber
E316EH197RUS       1  1300.0  Volkswagen
E316EH197RUS       1  1300.0  Volkswagen  Touareg